Revit 2024 API
AnalyticalEquipmentLoadData Class
 Represents the data and parameters of point load node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public class AnalyticalEquipmentLoadData : AnalyticalDistributionNodePropertyData
Visual Basic
Public Class AnalyticalEquipmentLoadData _
	Inherits AnalyticalDistributionNodePropertyData
Visual C++
public ref class AnalyticalEquipmentLoadData : public AnalyticalDistributionNodePropertyData
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Electrical.AnalyticalDistributionNodePropertyData
 Autodesk.Revit.DB.Electrical.AnalyticalEquipmentLoadData
See Also
AnalyticalEquipmentLoadData Members
Autodesk.Revit.DB.Electrical Namespace